{
  "elevatedvision.name": "Elevated Vision",

  "elevatedvision.settings.use-shadow-lighting.name": "Default: Adjust Lighting for Elevation",
  "elevatedvision.settings.use-shadow-lighting.hint": "Adjust lighting for limited height walls and elevated regions. Can adjust per-scene using the scene configuration.",

  "elevatedvision.settings.use-shadow-vision.name": "Default: Adjust Vision for Elevation",
  "elevatedvision.settings.use-shadow-vision.hint": "Adjust token vision for limited height walls and elevated regions. Can adjust per-scene using the scene configuration.",

  "elevatedvision.settings.elevationmin.name": "Default: Elevation Minimum",
  "elevatedvision.settings.elevationmin.hint": "Default elevation minimum for new scenes. Can adjust per-scene using the scene configuration.",

  "elevatedvision.settings.elevationstep.name": "Default: Elevation Increment",
  "elevatedvision.settings.elevationstep.hint": "Default elevation increment for new scenes. Can adjust per-scene using the scene configuration.",

  "elevatedvision.settings.point-light-size.name": "Default: Light Size",
  "elevatedvision.settings.point-light-size.hint": "Default radius of the physical light sphere. Foundry default treats lights as point sources (0-sized). Larger values create larger shadow penumbra. Can adjust individual lights in their respective light configurations.",

  "elevatedvision.settings.lights-full-penumbra.name": "Full Shadow Penumbra",
  "elevatedvision.settings.lights-full-penumbra.hint": "When enabled, lighting for all walls will display a full penumbra for the shadow. When disabled, the penumbra shadow for infinite-height walls may display differently than the shadow for limited-height walls. Disabling may improve compatibility with other modules. ",

  "elevatedvision.settings.test-visibility.name": "Override Visibility Tests",
  "elevatedvision.settings.test-visibility.hint": "When enabled, Elevated Vision will override the Foundry default visibility testing. This is necessary if you want token visibility to work with directional lighting, limited height walls, or with the Full Shadow Penumbra setting. Disable if some other module is taking over visibility testing.",

  "elevatedvision.sceneconfig.elevationmin.name": "Minimum Elevation",
  "elevatedvision.sceneconfig.elevationmin.hint": "Minimum elevation for this scene.",

  "elevatedvision.sceneconfig.elevationstep.name": "Elevation Increment",
  "elevatedvision.sceneconfig.elevationstep.hint": "Elevation steps (increments) permitted in this scene. Maximum elevation for a scene equals minimum + 255 * increment.",

  "elevatedvision.sceneconfig.use-shadow-lighting.name": "Adjust Lighting for Elevation",
  "elevatedvision.sceneconfig.use-shadow-lighting.hint": "Adjust lighting for limited height walls and elevated regions within this scene.",

  "elevatedvision.sceneconfig.use-shadow-vision.name": "Adjust Vision for Elevation",
  "elevatedvision.sceneconfig.use-shadow-vision.hint": "Adjust token vision for limited height walls and elevated regions within this scene.",


  "elevatedvision.ambientconfig.legendtitle": "Elevated Vision",

  "elevatedvision.ambientconfig.lightSize.name": "Light Size",
  "elevatedvision.ambientconfig.lightSize.hint": "Radius of the physical light sphere. Foundry default treats lights as point sources (0-sized). Larger values create larger shadow penumbra.",

  "elevatedvision.ambientconfig.directionallight.name": "Directional Light",
  "elevatedvision.ambientconfig.directionallight.hint": "Treat this light like a sun or moon—--placed at a given direction and angle above the horizon. Requires WebGL shadows.",

  "elevatedvision.ambientconfig.azimuth.name": "Azimuth",
  "elevatedvision.ambientconfig.azimuth.hint": "Canvas X/Y direction from which the directional light appears along the horizon. 0º is due east; 90º is due south. The location of this light on the canvas determines its azimuth.",

  "elevatedvision.ambientconfig.elevationAngle.name": "Elevation Angle",
  "elevatedvision.ambientconfig.elevationAngle.hint": "Angle of the directional light above the horizon. 90º is directly overhead, and results in no shadows. Distance of this light from the canvas center controls elevation angle; the elevation angle increases as the light approaches the center.",

  "elevatedvision.ambientconfig.solarAngle.name": "Solar Angle",
  "elevatedvision.ambientconfig.solarAngle.hint": "Controls the amount of the penumbra (the fuzzy area) in the wall shadow. Approximates the angle of the directional light as seen at the canvas level. A smaller angle results in a smaller penumbra.",

  "elevatedvision.regionconfig.blocks-vision.name": "Blocks Vision?",
  "elevatedvision.regionconfig.blocks-vision.hint": "When enabled, the region blocks vision and casts shadow as if it were a solid 3d shape. If Terrain Mapper is active, the height will be set to the plateau or ramp if those options are selected in the Terrain Mapper tab."
}
