{
  "elevatedvision.name": "Elevation",

  "elevatedvision.settings.shading-algorithm.name": "Default for elevation shadows",
  "elevatedvision.settings.shading-algorithm.hint": "Set the default shadow method for new scenes. Can adjust per-scene using the scene configuration. Polygons: Represent shadows caused by limited-height walls using polygons for token vision. WebGL: Use WebGL for light shadows and token vision caused by limited height walls. In addition, use WebGL to shade canvas areas for lights and token vision where terrain is higher than the light or token vision respectively.",

  "elevatedvision.settings.shading-none": "None",
  "elevatedvision.settings.shading-polygons": "Polygons",
  "elevatedvision.settings.shading-webgl": "WebGL",

  "elevatedvision.settings.elevationmin.name": "Default elevation minimum",
  "elevatedvision.settings.elevationmin.hint": "Default elevation minimum for new scenes. Can adjust per-scene using the scene configuration.",

  "elevatedvision.settings.elevationstep.name": "Default elevation increment",
  "elevatedvision.settings.elevationstep.hint": "Default elevation increment for new scenes. Can adjust per-scene using the scene configuration.",

  "elevatedvision.settings.auto-change-elevation.name": "Default for automatic token elevation",
  "elevatedvision.settings.auto-change-elevation.hint": "Set the default automatic token method for new scenes. Can adjust per-scene using the scene configuration. If enabled, will automatically adjust token elevation based on elevation layer data. Token elevation is only adjusted if the token is currently 'on the ground', meaning the token's starting elevation equals the terrain elevation.",

  "elevatedvision.settings.auto-change-elevation.averaging.name": "Average token elevation",
  "elevatedvision.settings.auto-change-elevation.averaging.hint": "When auto-adjusting, use the average elevation under the token shape. If false, use the token center-point to determine elevation.",

  "elevatedvision.settings.enhance-cw-sweep.name": "Enhance LOS calculation",
  "elevatedvision.settings.enhance-cw-sweep.hint": "Experimental. Uses the fill algorithm to provide a potential speed-up to the line-of-sight calculation used by vision, sound, and lighting. When the token or source is completely enclosed by a set of walls, this allows sweep to shortcut various calculations. Requires additional calculations when walls are created, updated, or destroyed. May be useful for very large dungeon scenes.",

  "elevatedvision.settings.add-fly-button.name": "Add Token Fly control",
  "elevatedvision.settings.add-fly-button.hint": "Add a control to the token toolbar that can be enabled or disabled to tell Elevated Vision when a token should be considered capable of flight. When the control is enabled, automatic token elevation will keep tokens above the ground when moved off a terrain or tile cliff greater than the token height.",

  "elevatedvision.settings.color-min.name": "Elevation Minimum Color",
  "elevatedvision.settings.color-min.hint": "Set the color used to display the minimum elevation (above the scene minimum) on the elevation layer.",
  "elevatedvision.settings.color-max.name": "Elevation Maximum Color",
  "elevatedvision.settings.color-max.hint": "Set the color used to display the maximum elevation on the elevation layer. Colors between min and max will be interpolated.",
  "elevatedvision.settings.color-min.string_hint": "Set the color used to display the minimum elevation (above the scene minimum) on the elevation layer. Install the Color Picker module to get a color picker here.",
  "elevatedvision.settings.color-max.string_hint": "Set the color used to display the maximum elevation on the elevation layer. Colors between min and max will be interpolated. Install the Color Picker module to get a color picker here.",

  "elevatedvision.controls.fill-by-grid.name": "Fill by grid",
  "elevatedvision.controls.fill-by-los.name": "Fill by line-of-sight",
  "elevatedvision.controls.fill-space.name": "Fill space enclosed by walls",
  "elevatedvision.controls.clear.name": "Clear all",
  "elevatedvision.controls.clear.confirm.title": "Clear all elevation data",
  "elevatedvision.controls.clear.confirm.content": "Are you sure you want to remove all elevation data from the scene?",
  "elevatedvision.controls.upload.name": "Upload elevation data and replace in scene",
  "elevatedvision.controls.download.name": "Download elevation data",
  "elevatedvision.controls.undo.name": "Undo",
  "elevatedvision.controls.directional-light.name": "Directional Light",

  "elevatedvision.controls.add-fly-button.name": "Elevated Tokens Fly",

  "elevatedvision.shading-none": "None",
  "elevatedvision.shading-polygons": "Polygons",
  "elevatedvision.shading-webgl": "WebGL",

  "elevatedvision.sceneconfig.elevationmin.name": "Minimum Elevation",
  "elevatedvision.sceneconfig.elevationmin.hint": "Minimum elevation for this scene.",

  "elevatedvision.sceneconfig.elevationstep.name": "Elevation Increment",
  "elevatedvision.sceneconfig.elevationstep.hint": "Elevation steps (increments) permitted in this scene. Maximum elevation for a scene equals minimum + 255 * increment.",

  "elevatedvision.sceneconfig.autoelevate.name": "Auto Elevate Tokens",
  "elevatedvision.sceneconfig.autoelevate.hint": "When enabled, tokens automatically adjust elevation based on elevation layer data when moving. Token elevation is only adjusted if the token is currently 'on the ground.'",

  "elevatedvision.sceneconfig.shading-algorithm.name": "Display Elevation Shadows",
  "elevatedvision.sceneconfig.shading-algorithm.hint": "Polygons: Represent shadows caused by limited-height walls using polygons for token vision. WebGL: Use WebGL for light shadows and token vision caused by limited height walls. In addition, use WebGL to shade canvas areas for lights and token vision where terrain is higher than the light or token vision respectively. Will force scene reload if changed.",

  "elevatedvision.ambientconfig.legendtitle": "Elevated Vision",
  "elevatedvision.ambientconfig.elevation.name": "Elevation",
  "elevatedvision.ambientconfig.elevation.hint": "Elevation of this source.",

  "elevatedvision.tileconfig.legendtitle": "Elevated Vision",
  "elevatedvision.tileconfig.elevation.name": "Elevation",
  "elevatedvision.tileconfig.elevation.hint": "Elevation of this tile. If Levels module is active, this will be linked to the bottom tile elevation for Levels. If elevation is finite, it will override terrain elevation at that point if the token is on or above the tile."
}
